[
  {
    "title": "Search Atlas - Advanced SEO Software: Backend Engineer- Python",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0167/0327/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> 10001\n    <br /><strong>URL:</strong> <a href=\"https://searchatlas.com\">https://searchatlas.com</a>\n</p>\n\n<div>Hi! We’re Search Atlas Group, a SEO software company, focused on engineering products and services that help websites improve their performance on Google. We are a rapidly growing organization with clients from Fortune 500 companies to leading Silicon Valley tech startups, and we're looking to bring on a more Backend Engineers to help us propel our growth.<br /><br />\n</div><div>\n<br />Company Tech Stack<br /><br />\n</div><ul>\n<li>Backend: Django, Python 3, Docker Compose</li>\n<li>Frontend: Typescript, ReactJS + NextJS Framework</li>\n<li>DevOps: GCP, Kubernetes, ArgoCD, GitLab</li>\n<li>DBs: Postgres, ClickHouse, Redis</li>\n<li>Scrum: Gitlab Boards</li>\n<li>Local Development Environments: Mac OS or Linux</li>\n</ul><div>\n<br />Job Description<br /><br />\n</div><div>We are looking for full stack, frontend, and backend engineers with strong experience in Python and Django frameworks. In this role you will be initially assigned to one of our product teams and help your team of 5-6 people build new product features!<br /><br />\n</div><div>\n<strong>Backend Python/Django candidates must have:<br /></strong><br />\n</div><ul>\n<li>Strong experience with Python - 5+ years</li>\n<li>Experience with Django Rest Framework- 5+ years</li>\n<li>Experience writing test cases and TDD</li>\n<li>Experience with MySQL or Postgres- 3+ years</li>\n<li>Knowledge of Scrum</li>\n<li>Basic knowledge of Flake8 code quality</li>\n<li>Frontend experience with ReactJS &amp; Typescript is a nice bonus!</li>\n</ul><div>\n<strong>Benefits<br /></strong><br />\n</div><ul><li>11 days PTO</li></ul><div>\n<strong>Salary<br /></strong><br />\n</div><ul><li>$2,000-$4,000/USD monthly</li></ul><div>\n<strong>Life at Search Atlas Group<br /></strong><br />\n</div><div>At Search Atlas Group, we are committed to enjoying life as we are to delivering best-in-class services and software. From community volunteer days, socially conscious initiatives, and team lunches and outings, our office reflects our team’s diverse interests.<br /><br />\n</div><div>We’re a growing team of diverse professionals, however, we all share the same goals: to be a part of a company that’s on the edge of digital marketing, to make the world a better place, and to have fun doing it. Our team culture is one of fast-paced innovation, where each person is empowered to take on their own ambitious projects, with the support of their teammates. We’ve got plenty of perks, but the biggest one is working with other energetic high-achievers.<br /><br />\n</div><div>We are very proud of the kind, inclusive, and collaborative company culture we have built and have been very lucky to be recognized by both national and local industry leaders:<br /><br />\n</div><ul>\n<li>2023 + 2022 Inc. 5000 List of the Fastest-Growing Companies in America</li>\n<li>Nevada’s Top Workplaces - #1 Small Business (Under 150 Employees), Best New Ideas</li>\n<li>Best Start-Up Agency (U.S. Search Awards)</li>\n<li>Top B2B Companies (Clutch)</li>\n<li>Inc’s On The Rise and Best Places to Work (Inc. Magazine)</li>\n<li>Great Place to Work Certified (Great Place to Work)</li>\n</ul><div>\n<strong>Here's a look into our core values:<br /></strong><br />\n</div><div>\n<em>1. Collaborative and Highly Engaged<br /></em><br />\n</div><div>\n<em>Work is where we invest a big chunk of our lives. And hey, we're all about making that time awesome! Picture this: we're not just coworkers; we're like a squad that's always got each other's backs. We're all about cheering each other on, sharing what we know, and picking each other up when things get messy. Plus, we're big on being real with each other, so there's no room for office drama or gossip. We're all about that good vibes-only vibe!<br /></em><br />\n</div><div>\n<em>2. Pursues Excellence<br /></em><br />\n</div><div>\n<em>We're not just about doing our jobs; we're on a mission to master our craft. With a growth mindset and a desire to learn and grow, we're relentless in our pursuit of excellence. Mediocrity? Nah, not our style. We're all about raising the bar and becoming the absolute best in our field. Smashing goals? It's our fuel. And we do it all together, thriving on shared success.<br /></em><br />\n</div><div>\n<em>3. I can figure it out/Google it attitude<br /></em><br />\n</div><div>\n<em>Hey, nobody's got all the answers, right? That's why our team rocks - because they're all about that thirst for knowledge and the know-how to quench it. Thanks to the vast wonders of the internet, there's practically nothing we can't figure out. Stumped on something? No sweat, just dive into the Google pool!<br /></em><br />\n</div><div>\n<em>We're a crew of go-getters, always ready to tackle challenges head-on. While we thrive on collaboration, we're also no strangers to taking the reins and finding solutions independently.<br /></em><br />\n</div><div>\n<em>4. Innovative<br /></em><br />\n</div><div>\n<em>We're all about agility, evolution, and innovation. Flexibility is our middle name—we're constantly refining, experimenting, and pushing boundaries. New ideas? Bring 'em on! Creativity is our secret sauce, and thinking outside the box is just how we roll. Forget about the status quo; we're all about embracing change. We're not attached to an old way of doing things - We're attached to winning<br /></em><br />\n</div><div>\n<em>5. Student Mentality<br /></em><br />\n</div><div>\n<em>We dedicate ourselves to uplifting each other and pushing Search Atlas onwards and upwards (to the moon!). Mistakes and rough days happen to everyone, but we approach them with understanding and trust in each other's good intentions. Our team remains grounded and committed, persistently striving to improve. Mistakes are opportunities for growth; we embrace them, learn from them, and continually evolve as a result.<br /></em><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/search-atlas-advanced-seo-software-backend-engineer-python\">https://weworkremotely.com/remote-jobs/search-atlas-advanced-seo-software-backend-engineer-python</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/search-atlas-advanced-seo-software-backend-engineer-python",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Zamp: Senior Full-Stack Software Engineer",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0146/9394/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Remote\n    <br /><strong>URL:</strong> <a href=\"https://zamp.com/\">https://zamp.com/</a>\n</p>\n\n<div>\n<strong>Working at Zamp<br /></strong><br />\n</div><div><em>What We value:</em></div><ul>\n<li>Stability<ul><li>Everything we build is intentional and thought out. We build knowing that we’ll be working on this code for years. We index on quality over speed. Our tech reflects our love for stability in that we use typescript heavily and write tests thoroughly. </li></ul>\n</li>\n<li> Iteration<ul><li>Much like a good essay each PR requires at least 2 reviewers and involves rounds of revision and improvement. We embrace this and the challenges that come with it.</li></ul>\n</li>\n<li>Learning<ul><li>None of us have arrived. We want to keep learning, experimenting and developing our own skills and our technology over time. Anyone willing to make a case for a new upgrade is heard.</li></ul>\n</li>\n<li>Async work and communication<ul><li>We have very few meetings. We embrace JOMO (The joy of missing out). This allows for deep focus and we want as much flow in our work as possible. This requires commitments from the team to deliver and provide feedback frequently and we depend on one another to get things done.</li></ul>\n</li>\n</ul><div><br /></div><div><em>You’ll hate it here if:</em></div><ul>\n<li>You see your code as your own property and are therefore defensive of your work and ideas <ul><li>Pride gets in the way of progress and we are all learning. </li></ul>\n</li>\n<li>You need someone to tell you how to spend your time at work<ul><li>We are all adults and are not here to babysit.</li></ul>\n</li>\n<li>Are easily offended <ul><li>We value direct clear communication without sugar coating.   </li></ul>\n</li>\n<li>You live for the thrill of code slinging<ul><li>There is a time and place for being a cowboy but dealing with financial data is not the time. </li></ul>\n</li>\n</ul><div>\n<br />Our tech: NextJS focused, with some event driven flair thrown in. Really focus is on strongly typed TypeScript—you need to bleed types. TypeScript, NextJS, and database skills are all wins. <br /><br />\n</div><div><strong>Senior Full-Stack Engineer:</strong></div><div>This role requires being a member of a team that is highly collaborative. You will own projects and review code for your team as they own their own projects. Looking for someone who wants to build software and has been doing it for at least 10 years. We prefer Next.js experience, but any strongly typed experience will be considered.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/zamp-senior-full-stack-software-engineer\">https://weworkremotely.com/remote-jobs/zamp-senior-full-stack-software-engineer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/zamp-senior-full-stack-software-engineer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Doximity: Software Engineer (Python), Data Platform",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0018/5463/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://www.doximity.com\">http://www.doximity.com</a>\n</p>\n\n<div>\n<br />Doximity is transforming the healthcare industry. Join our mission to help every physician be more productive and provide better care for their patients. As medicine's largest network in the United States, there's an elevated level of responsibility in everything we do. We don't take that responsibility lightly and are committed to building diverse teams with an inclusive culture that can make a direct impact on the healthcare system.<br /><br />\n</div><div>\n<br />One of Doximity's <a href=\"https://work.doximity.com/\">core values</a> is stretching ourselves. Even if you don't check off all the boxes below we encourage you to apply. Doximity is full of exceptional people who bring their own unique experiences to work everyday and make us all better for it!<br /><br />\n</div><div>\n<br />Data engineers on our data services team provide standardized tools, frameworks and libraries to empower data pipelining and analytics endeavors through a horizontally scalable data stack. The data services team is responsible for continuously improving the software environment for our data analysts, machine learning engineers, and data engineers at Doximity. Effectively maintaining and evolving the software layer on which all data teams at Doximity build.<br /><br />\n</div><div>\n<br />This role can be filled in our San Francisco headquarters OR remotely in the U.S.<br /><br />\n</div><div>\n<strong><br />How you’ll make an impact <br /></strong><br />\n</div><ul>\n<li>Collaborate with data analysts, data engineers, and machine learning engineers to understand their future needs and current blockers to ensure the Doximity data stack will meet future needs and reduce existing blockers</li>\n<li>Understand what our data product teams are trying to achieve. Principally, to help you propose, architect, design, and implement solutions and best practices to maximize the time they can spend on their immediate goals. While minimizing the time they need to spend on unrelated or redundant technical hurdles</li>\n<li>Continuously improve our software engineering culture within the data organization by leading through example</li>\n<li>Work with other teams on isolating and understanding development, performance, and stability issues - together with the data infrastructure team, you will be part of the last line of defense to resolve problems facing members of our data teams</li>\n</ul><div>\n<strong><br />What we’re looking for<br /></strong><br />\n</div><ul>\n<li>You have professional data engineering or internal tooling experience with a focus on supporting several product teams concurrently</li>\n<li>You are fluent in Python and SQL and have some lower-level understanding of programming language internals, Linux, and networking.</li>\n<li>You understand what separates good and bad data pipelines</li>\n<li>You are foremost an engineer, making you passionate about high code quality, automated testing, and engineering best practices</li>\n<li>You have the ability to self-manage, prioritize, and deliver functional solutions</li>\n<li>You possess advanced knowledge of analytical databases, software engineering practices, testing methodologies, and data analytics.</li>\n<li>You agree that concise and effective written and verbal communication is a must for a successful team</li>\n</ul><div>\n<strong><br /><br />Compensation<br /></strong><br />\n</div><div>\n<br />The US total compensation range for this full-time position is $165,000 to $195,000 (inclusive of salary and equity). Our ranges are determined by role and level. The range displayed on each job posting reflects the approximate total target compensation for the position across the U.S. Within the range, individual pay is determined by factors including relevant skills, experience, and education/training. <br /><br /><br />\n</div><div>\n<strong><br />More on Benefits &amp; Perks<br /></strong><br />\n</div><div>\n<br />Doximity is proud to offer industry-leading benefits to our full time employees. Some of our offerings include: <br /><br />\n</div><ul>\n<li>Medical, dental, vision offerings for you and your family</li>\n<li>401k with matching program</li>\n<li>Employee stock purchase plan</li>\n<li>Family planning support, Childcare FSA, and parental leave</li>\n<li>Life, AD&amp;D, and Disability</li>\n<li>Generous time off, holidays and paid company trips</li>\n<li>Wellness benefits…plus many more!</li>\n</ul><div>\n<strong><br />More About Doximity…<br /></strong><br />\n</div><div>\n<br />For the past decade, it’s been our mission to help every physician be more productive so they can provide better care for their patients. We believe that when doctors are connected, the healthcare system works better and patients benefit. Doximity enables our verified clinician members to collaborate with colleagues, stay up-to-date with the latest medical news and research, manage their careers, and conduct virtual patient visits. Today, Doximity is the leading digital platform for U.S. medical professionals, with over 80% of physicians, 50% of all nurse practitioners and physician assistants, and 90% of graduating medical students as members. <br /><br />\n</div><div>\n<br />Joining Doximity means being part of an incredibly talented and humble team passionate about improving inefficiencies in our $4.3 trillion U.S. healthcare system. We are a team of doers who solve problems everyday by treating obstacles like an adventure, and we love creating technology that has a real, meaningful impact on people’s lives. Doxers are committed to working towards a more equitable world both within and beyond our office walls. This starts by fostering an inclusive and diverse work environment where differences are valued and all employees are encouraged to bring their full, authentic selves to work daily. To learn more about our team, culture, and users, check out our <a href=\"https://workat.doximity.com/\">careers page</a>, <a href=\"https://blog.doximity.com/\">company blog</a>, and <a href=\"https://engineering.doximity.com/\">engineering blog</a>. We’re growing fast, and there’s plenty of opportunity for you to make an impact—join us! For more information, visit<a href=\"http://www.doximity.com/\"> Doximity.com</a>.<br /><br />\n</div><div>\n<br />____________________________________________<br /><br />\n</div><div>\n<strong><em><br />EEOC Statement<br /></em></strong><br />\n</div><div>\n<em><br />Doximity is proud to be an equal opportunity employer, and committed to providing employment opportunities regardless of race, religious creed, color, national origin, ancestry, physical disability, mental disability, medical condition, genetic information, marital status, sex, gender, gender identity, gender expression, pregnancy, childbirth and breastfeeding, age, sexual orientation, military or veteran status, or any other protected classification. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law<br /></em><br />\n</div><div>\n<strong><br /> <br /></strong><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/doximity-software-engineer-python-data-platform\">https://weworkremotely.com/remote-jobs/doximity-software-engineer-python-data-platform</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/doximity-software-engineer-python-data-platform",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Ticketsolve: Senior Backend Ruby on Rails Developer",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0016/1151/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Dublin\n    <br /><strong>URL:</strong> <a href=\"https://ticketsolve.com\">https://ticketsolve.com</a>\n</p>\n\n<div># Introduction<br /><br />We are a SaaS ticketing platform that is very excited about the future. Coming out of the pandemic, we completed an exciting evolution of our platform. This involved moving from a traditional RoR architecture to a modern \"single page application\" (SPA), exposing our application as a set of APIs consumed by Ember to provide a rich interactive experience.<br /><br />Completing this work has allowed us to focus on new feature development. We have already seen the benefits of the new platform in terms of productivity and speed of rolling out new features.<br /><br />We want to expand our backend team with new people to cover Ruby and Ruby on Rails server development to accelerate this potential and deliver an ambitious product roadmap. In terms of experience, we are looking for experienced developers who are comfortable working with a large codebase and a complex domain.<br /><br />The work will be a mixture of new feature development exposed as APIs for the front-end development team and infrastructure-focused improvements on our backend.<br /><br />The feature areas we focus on are significant enhancements to our CRM functionality, improvements to our public API and investment in Business Intelligence and Analytics. <br /><br />This year, a specific focus will be on building out our data and analytic capabilities using a combination of Snowflake at the data layer and Sigma for visualisation. This work will then provide a platform for integrating AI capabilities into our platform.<br /><br /># Skills &amp; Requirements<br /><br />- 4+ years experience developing web applications<br /><br />- Experience with programming Ruby/Rails required with the role focused on server development<br /><br />- Understanding of front-end technologies: JavaScript, HTML, CSS, and JS frameworks like React/Ember are welcomed but not required<br /><br />- Experience with Chef and Terraform a bonus<br /><br />- Strong programming skills with a focus on clean design, well-refactored code and automated testing<br /><br />- Experience with Business Intelligence and Analytics is also welcomed but  not required<br /><br />- Comfortable working as part of a fully remote dev team.<br /><br /># Technologies we use<br /><br />- Ruby on Rails is our primary server framework evolving towards pure API server<br /><br />- EmberJs is our primary front-end development framework<br /><br />- JSONAPI::Resources, http://jsonapi-resources.com/, is how we are building our APIs<br /><br />- MySQL / Redis are our primary storage engines<br /><br />- Snowflake / Sigma are our chosen data, analytics and AI-enabling technologies<br /><br />- All our servers are Ubuntu based managed through CHEF<br /><br />- Deployed on AWS using Terraform for managing infrastructure<br /><br />- GitHub for source code management and process support<br /><br />- GitHub actions for continuous integration<br /><br /># How we work<br /><br />We run a lightweight process that focuses on feature-based weekly delivery. Our coordination and communication are mostly through daily 'catch-up meetings' and appropriate tools such as Linear for backlog management, Slack for communication and Git(GitHub) for source control and feature deployment through PRs and Milestones.<br /><br />From a coding perspective, we strongly emphasise clean, minimal, well-refactored code backed up by a robust suite of automated tests. In addition, we use peer review for all design and development work.<br /><br />In general, we strive for an approach that empowers and trusts individuals to 'do the right thing'; as a team, we try to keep each other true to this.<br /><br /># 100% Remote working<br /><br />Our development team works remotely with members in Austria, Germany, Portugal, Sweden, South Africa, Ireland and the United Kingdom. Our wider organisation has people based in the United Kingdom and Ireland. Dublin is our headquarters and main office - with the core Support and Sales and Marketing teams.<br /><br />Remote working has been part of our company's DNA since our founding. It offers many advantages to both Ticketsolve and its employees. This culture means you should be comfortable working as part of a fully remote team.<br /><br />Important to note that time zones are a consideration for us with remote working. Our experience is that European, some Asian and East Latin American time zones are preferable, allowing for collaboration at reasonable times.<br /><br /># Recruitment process<br /><br />We are initially looking for resumes and portfolio examples of your work, e.g., GitHub repositories, blog articles, etc. If you do not have anything suitable, don't worry. As part of the process, we will introduce some coding tasks, e.g., code reviews, whiteboard design sessions, and pair programming.<br /><br />From there, we filter down and do a series of remote interviews. We start with an introduction call to explain the project and answer questions. From there, we will have a mixture of technical and culture-fit calls. <br />We prefer that candidates talk to as much of the team as possible so that we, the team and the candidate, can make the best decision possible. We will also look at facilitating face-to-face meetings if appropriate and makes sense.<br /><br />After this stage, we will be in a position to make a formal offer.<br /><br />Please submit resumes to **jobs@ticketsolve.com** with the subject **\"Job Application\"**. Please note that we will not respond to all applications due to the volume of applications; instead, we will make contact when there is a potential fit.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/ticketsolve-senior-backend-ruby-on-rails-developer\">https://weworkremotely.com/remote-jobs/ticketsolve-senior-backend-ruby-on-rails-developer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/ticketsolve-senior-backend-ruby-on-rails-developer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Nordhealth: Senior Full-Stack Engineer (Laravel & Vue)",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0142/2312/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Finland\n    <br /><strong>URL:</strong> <a href=\"https://nordhealth.com\">https://nordhealth.com</a>\n</p>\n\n<div>\n<strong>👋 Who are we?<br /></strong><br />\n</div><div>\n<strong>Nordhealth</strong>’s mission is to build software that improves the daily lives of healthcare professionals. We create tools that empower veterinary and therapy professionals to provide the best possible care experiences to their patients. Our products are used daily by over <strong>50,000 professionals</strong> in over <strong>10,000 clinics and hospitals</strong> annually across <strong>30+ countries</strong> with 17+ years of experience in healthcare and veterinary software.<br /><br />\n</div><div>\n<strong>EasyPractice</strong> is the flagship product for the therapy unit in Nordhealth, enabling clinicians and therapists to manage their administrative work efficiently. With more than 40,000+ users and a software ecosystem touching over 2M+ people worldwide, EasyPractice is steadily growing. A key initiative is to step-by-step, as the EasyPractice platform evolves, migrate customers and users from older PMS products for EasyPractice to become our Unified PMS Platform. If you're passionate about solving problems and delivering excellent customer experiences, we might have the perfect role for you!<br /><br /><br />\n</div><div><strong>About the role  </strong></div><div><br /></div><div>As a Senior Full-Stack Engineer at Nordhealth and EasyPractice, you will have the opportunity to take ownership of your tasks from inception to delivery. We value autonomy, self-awareness, and creativity in our team members. Your expertise will be crucial in shaping and implementing various exciting projects within our dynamic environment.<br /><br />\n</div><div>Your primary responsibility will be to extend and maintain the EasyPractice system which will mainly involve working with <strong>Laravel</strong> and <strong>Vue.js</strong>. 🚀<br /><br />\n</div><div><br /></div><div>\n<strong>Your key responsibilities include: <br /></strong><br />\n</div><ul>\n<li>Setting high standards: Design and develop high-quality new solutions and features with Laravel Framework and Vue.js, setting the standard for code quality and best practices.<br /><br />\n</li>\n<li>Maintenance and optimization of our existing codebase to ensure optimal performance, scalability, and security.<br /><br />\n</li>\n<li>Conducting code reviews and providing constructive feedback to team members for continuous improvement.<br /><br />\n</li>\n<li>Collaborating seamlessly with cross-functional teams to identify and solve complex software challenges and architect innovative solutions.<br /><br />\n</li>\n<li>Assistance with technically advanced queries from our support tool<br /><br />\n</li>\n</ul><div><br /></div><div>While these are the primary tasks, you don't need to be an expert in everything. As a senior developer you are expected to have special expertise and actively share your knowledge and insights with the team.<br /><br />\n</div><div>\n<strong>Our Tech Stack<br /><br /></strong><br />\n</div><div>We’re huge fans of Laravel and the different tools in their ecosystem and our tech stack reflects that.<br /><br />\n</div><div>\n<em>Some of the technologies you will work with daily:<br /></em><br />\n</div><ul>\n<li>\n<strong>PHP / Laravel<br /></strong><br />\n</li>\n<li>\n<strong>VueJS 2.x/3.x<br /></strong><br />\n</li>\n<li>\n<strong>MySQL<br /></strong><br />\n</li>\n<li>\n<strong>Bootstrap and TailwindCSS<br /></strong><br />\n</li>\n</ul><div>\n<strong>What will help you to be successful in this role?<br /></strong><br />\n</div><div><br /></div><div>\n<strong>Ideally, you have:<br /></strong><br />\n</div><ul>\n<li>Extensive proficiency in Laravel Framework, PHP, HTML, CSS, Vue.js, and related technologies.<br /><br />\n</li>\n<li>A demonstrated history of complex database design and management (MySQL, PostgreSQL, etc.).<br /><br />\n</li>\n<li>The ability to thrive in a remote team environment, work independently and mentor others.<br /><br />\n</li>\n<li>Strong problem-solving skills and passion for continuous learning.<br /><br />\n</li>\n<li>Adaptability and resilience in the face of challenges.<br /><br />\n</li>\n<li>A strong work ethic, reliability, and the capability to take ownership of your projects, ensuring their successful execution and delivery.<br /><br />\n</li>\n<li>Excellent communication skills, both written and verbal.<br /><br />\n</li>\n</ul><div>Additionally, experience in technologies such as Typescript, Docker, Automated tests, DevOps practices, CI/CD pipelines, or Modular monoliths would be a valuable asset for this role.<br /><br />\n</div><div>\n<strong>For this role, we are seeking colleagues that are based in Europe.</strong><br /><br />\n</div><div>\n<strong>What’s in it for you? <br /></strong><br />\n</div><div>\n<strong><br />At Nordhealth/EasyPractice, we're in an exciting phase of growth, particularly within our development team. This presents a unique opportunity for you to be a part of our journey and contribute to our vibrant culture.<br /><br /></strong><br />\n</div><div>\n<strong>As a member of our team, you'll experience:<br /></strong><br />\n</div><div>😁 A warm and collaborative atmosphere where every team member is genuinely friendly and helpful<br /><br />\n</div><div>🌍 The freedom to work from anywhere in Europe, giving you the flexibility to create your ideal work environment<br /><br />\n</div><div>🕘 The autonomy to set your own working hours, enabling you to achieve a work-life balance that suits you<br /><br />\n</div><div>💪 You’ll have a strong influence on how the product is being developed. We value your input!<br /><br />\n</div><div>✈️ Company meet-ups once a year to get to know your team members and just have a great time together!<br /><br />\n</div><div>🗺️ Being a remote company, we have colleagues working from around the world<br /><br />\n</div><div>\n<br />If you relish the idea of working in a fast-growing, international setting, and you're passionate about contributing to a friendly and collaborative culture, then this could be the perfect job for you. Join us and be part of our ongoing success story. <strong>Apply now! We'll fill the position as soon as we find the right person.<br /></strong><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/nordhealth-senior-full-stack-engineer-laravel-vue\">https://weworkremotely.com/remote-jobs/nordhealth-senior-full-stack-engineer-laravel-vue</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/nordhealth-senior-full-stack-engineer-laravel-vue",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Hostaway Opco Oy: Engineering Technical Lead - Node.js - EMEA",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0136/4009/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Finland\n    <br /><strong>URL:</strong> <a href=\"https://hostaway.com\">https://hostaway.com</a>\n</p>\n\n<div>\n<strong>NOTE: This is a FULLY remote role, but the candidate must be within the EMEA (Europe, Middle East, and Africa) region in order to collaborate with their team, peers, and customers. You do not have to be in the specific country or city shown in this listing, but please do not apply if you are not physically based within the EMEA region.<br /><br /></strong><br />\n</div><div>Please note that although this position offers the flexibility of remote work, it requires a full-time commitment to supporting Hostaway exclusively<br /><br />Hostaway is a SaaS startup that is transforming the vacation rental industry. With innovative solutions and partnerships with giants like Airbnb, VRBO, and Booking, we're taking on the competition and winning. Leveraging our customer-centric core values, we consistently deliver results that encourage growth, learning, and innovation for our team, our customers, and the industry.<br /><br />\n</div><div>\n<br />As a profitable and growing company, this role is necessitated by our continued growth<br /><br /><strong>About the role<br /></strong><br />\n</div><div>Tech Leads within Hostaway are in a pivotal technical leadership role to ensure their cross-functional team builds the right solutions that solve customer problems in a way that is secure, extensible and scalable for the future. Tech Leads are expected to govern the technical maturity for their respective domain, having a clear view of the architectural challenges and how to remediate them over time.</div><div><br /></div><div>Having a close relationship with the domain’s Product Manager is key. While the PM brings the <em>what</em>, you are their peer responsible for bringing the <em>how</em>. Digging deep into the business problem the PM is trying to solve is key to be able to make the right decisions on how to shape the technical solution for the team to work on.<br /><br />\n</div><div>You are supported by an Engineering Manager who will help guide the day-to-day delivery aspects of the team, ensuring we break work down into tangible small tasks, focus on a sustainable but high-performing delivery cadence, and ensure we have the right candidates in place.<br /><br /><strong>Requirements: </strong>\n</div><ul>\n<li>6+ years of experience in SaaS software development, with at least 2 years in a leadership role.</li>\n<li>Expert-level proficiency in NodeJS, a strong preference for TypeScript</li>\n<li>Strong understanding of relational databases (like MySQL or PostgreSQL)</li>\n<li>Familiarity with transitioning event-driven service oriented architectures by applying Domain Driven Design (DDD) principles</li>\n<li>Event driven messaging experience (i.e. Kafka, Kinesis).</li>\n<li>Strong experience with unit testing (using jest or similar)</li>\n<li>Experience with Agile methodologies and CI/CD practices.</li>\n<li>Ability to balance technical debt with delivery of new features in a fast-paced environment.</li>\n</ul><div><br /></div><div><strong>Nice to have skills for this role:</strong></div><ul>\n<li>Experience with NoSQL databases (like DynamoDB or MongoDB)</li>\n<li>Experience building cloud native apps, leveraging AWS managed services</li>\n<li>Having used PHP in the past or not afraid to dive into some of the current PHP business logic</li>\n<li>Applying, coaching and mentoring Extreme Programming (XP) agile practices</li>\n<li>Front-end experience with React and micro-frontends</li>\n<li>Knowledge of containerisation technologies (Docker, Kubernetes) and DevSecOps practices</li>\n</ul><div><br /></div><div><strong>An Average Day for a Tech Lead</strong></div><ul>\n<li>10:00-10:15 Quick team stand-up, one of your team members seem to be working on a problem you worked on before, and offer to pair with them after the stand-up to support</li>\n<li>10:30-14:00 Pairing with one of your team members to work on a complex scalability issue together and grabbing a quick bite to re-fuel those pesky braincells in-between coding sessions!</li>\n<li>14:00-15:00 Doing a design session with the Product Manager and UX designer for a large upcoming feature that the team should pick up next week. You ask a lot of questions to drill down to the problem we are trying to solve, and suggest some easier solutions that require less effort for the team.</li>\n<li>15:00-16:00 The design session triggered some thoughts about other areas of the system that will be affected. You’re doing a quick dive in the affected areas of the code and find some technical debt that might affect the system’s scalability or reliability. You create a brief Jira ticket and tag the Product Manager to help get it prioritised and to ensure it is not forgotten. You also ping the ticket to one of the other domains' tech leads, as you recall them mentioning a similar problem existing in another domain team.</li>\n<li>16:00-16:30 Quick catch-up with the Engineering Manager on the teams delivery reliability and how you can help keep Work in Progress (WIP) and Pull Request (PR) review time to a minimum</li>\n<li>16:30-18:00 Talking about PR’s, there are actually still a few open. You take the last part of the day to review your teams PRs. There are some great solutions offered, but one of the junior engineers introduced some code that is difficult to maintain and is lacking unit tests. You jump on a quick call with them to explain the issues and why it matters.</li>\n</ul><div><strong><br />What we offer</strong></div><ul>\n<li>\n<strong>Competitive Compensation:</strong> We offer competitive pay based on market rates in the country of the applicant.</li>\n<li>\n<strong>100% Remote:</strong> Enjoy the freedom to work from anywhere within your country of residence—be it a co-working space, your home office, or even your dining room table. The choice is yours. Just don’t ask to work in our office (we don’t have one).</li>\n<li>\n<strong>Equity:</strong> Every role in our company comes with valuable stock options in a fast-growing and profitable company. This ensures we all share in the company’s success.</li>\n<li>\n<strong>Values-Driven Leadership:</strong> Our Core Values are not just words we’ve written to make us feel good. We leverage them daily when making strategic and tactical decisions.</li>\n<li>\n<strong>Professional Growth:</strong> Our rapid growth offers unparalleled learning and development opportunities, along with a multitude of career advancement opportunities.</li>\n<li>\n<strong>Annual Paid Leave:</strong> The specific amounts vary by country and are aligned with country and/or contract-specific norms.</li>\n<li>\n<strong>Geographic Specific Benefits:</strong> As an international employer, we offer different country-specific benefits such as Health Insurance and Pensions in countries where these perks are customary. The specifics depend on the country of the applicant.</li>\n<li>\n<strong>Dynamic Team Culture:</strong> As a global company with team members in over 40 countries, our diverse and international culture fuels our innovation and creativity, providing a key pillar to our success (and making it a lot of fun to work here).</li>\n</ul><div><br /></div><div>Thank you for your interest. If you apply for this role, you will receive an email from our Talent Acquisition team after your application has been reviewed alongside the qualifications for this role and the qualifications of others who have applied.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/hostaway-engineering-technical-lead-node-js-emea-1\">https://weworkremotely.com/remote-jobs/hostaway-engineering-technical-lead-node-js-emea-1</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/hostaway-engineering-technical-lead-node-js-emea-1",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "SimplyAnalytics: Senior Frontend Developer",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0016/3878/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Toronto, Canada\n    <br /><strong>URL:</strong> <a href=\"https://simplyanalytics.com/\">https://simplyanalytics.com/</a>\n</p>\n\n<div>\n<strong>The Company</strong><br /><br />SimplyAnalytics is a powerful spatial analytics and data visualization application used by thousands of business, marketing, and social science researchers in the United States and Canada. It comes pre-packaged with 200,000+ data variables and allows our users to create maps, charts, tabular reports, and crosstabs. We are passionate about creating outstanding software, and we believe in test driven development, continuous integration, and code review.<br /><br />As a smaller company, each of our developers has an important role to play - at SimplyAnalytics, you are not just another cog in the wheel, you are an integral member of our team. You will be working on valuable features and making key decisions that impact the direction of the product and our users. In addition, we provide an excellent work-life balance, with 100% remote work, 20 personal days off, flexible work hours, a collaborative work environment, and quarterly “professional development days” to explore and share your interests with the rest of the team.<br /><br /><strong>The Role<br /></strong><br />We're looking for a Senior Frontend Developer to take on an important role in the development and maintenance of our cutting edge analytics and data visualization application. You'll be developing and maintaining production-quality in-house tools and customer-facing features within a large shared code base.<br /><br />The ideal candidate has experience working on complex single-page applications, is a self-starter, has a high level of attention to detail, is comfortable asking questions, enjoys working with talented colleagues, and has an interest in analytics and data visualization.<br /><br />We are a 100% remote company. Our employees can live and work anywhere in Canada, the United States, Mexico, Central America, or South America. This is a full-time salaried position. When applying, please include a cover letter.<br /><br /><strong>Responsibilities:</strong>\n</div><ul>\n<li>Design, develop, and test features, both in-house and customer-facing</li>\n<li>Write modern high-quality, clean, scalable, and maintainable code</li>\n<li>Contribute ideas for new features or improvements to existing features</li>\n<li>Assist colleagues through code-review, collaboration, and troubleshooting</li>\n</ul><div>\n<br /><strong>Required:</strong>\n</div><ul>\n<li>8+ years of professional software development experience on large, structured code bases using vanilla JavaScript (this is not a React, Angular, Node.js, or full-stack position)</li>\n<li>Strong UI development skills (CSS &amp; HTML)</li>\n<li>Open to learning new technologies</li>\n<li>Self-starter who gets things done</li>\n<li>Attention to detail</li>\n</ul><div>\n<br /><strong>Bonus:</strong>\n</div><ul>\n<li>Experience implementing data tables, charts, graphs, or other data visualizations</li>\n<li>Experience working on complex analytics, data visualization, or mapping applications</li>\n<li>D3.js experience</li>\n<li>MapLibre GL JS or Mapbox GL JS experience</li>\n<li>Experience with geospatial, demographic, business, marketing, or health data</li>\n<li>Experience with TypeScript</li>\n<li>Comfortable using Linux CLI</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/simplyanalytics-senior-frontend-developer-4\">https://weworkremotely.com/remote-jobs/simplyanalytics-senior-frontend-developer-4</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/simplyanalytics-senior-frontend-developer-4",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "BrandChamp: Senior Full-Stack JavaScript Engineer",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/6108/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> US Virgin Islands\n    <br /><strong>URL:</strong> <a href=\"https://brandchamp.io/?utm_source=weworkremote&amp;utm_medium=website&amp;utm_campaign=website&amp;utm_term=social&amp;utm_content=profile\">https://brandchamp.io/?utm_source=weworkremote&amp;utm_medium=website&amp;utm_campaign=website&amp;utm_term=social&amp;utm_content=profile</a>\n</p>\n\n<div>We’re looking to hire a Senior Full-Stack JavaScript Engineer with 5+ years experience who shares our passion for great product engineering. We’re looking for someone with strong backend skills and experience of developing and deploying in a high scale environment. Bonus points if you’re able to work full stack, but not essential for the role.</div><div>\n<br />While most of our customers are based in the US, our technical team operates out of Eastern Europe and Asia. Therefore, we are seeking a candidate who can collaborate effectively across these two time zones.</div><div><br /></div><div>\n<strong><br />Role<br /></strong><br />\n</div><div>You’ll be responsible for designing and delivering new product features and improving existing ones while keeping scalability, reliability, and performance in mind.</div><div>\n<br />Our infrastructure is hosted on AWS, with PostgreSQL RDS powering our database, Node.js for the API, and Vue.js with TypeScript on the frontend. We prioritize clean, maintainable, and well-tested code and are seeking someone who shares this commitment to quality.</div><div>\n<br />This is a great opportunity to have major input into a fast growing SaaS app and be part of an exciting, remote-friendly company.</div><div>\n<br />There’s a big product roadmap ahead of us so we’re looking to build a long term relationship with the right candidate. Please read the following requirements carefully before applying.</div><div><strong><br />Essential Skills</strong></div><ul>\n<li>5+ years experience with the majority in JavaScript</li>\n<li>Experience deploying software and database updates in a high scale environment</li>\n<li>Genuine interest in writing quality, maintainable code</li>\n<li>Experience independently designing and implementing large pieces of a system</li>\n<li>Proficiency in writing tests, with a strong focus on integration testing</li>\n<li>Strong relational database experience, preferably with PostgreSQL</li>\n<li>Using Node.js to build REST APIs, ideally using koa.js or express.js</li>\n<li>Keeps customers in mind and proactively raises issues or possible improvements</li>\n<li>Experience doing code reviews</li>\n<li>Git / Github</li>\n<li>Excellent spoken and written English</li>\n<li>Experience working remotely</li>\n</ul><div><strong><br />Bonus Points</strong></div><ul>\n<li>Experience with ecommerce platforms like Shopify and WooCommerce</li>\n<li>Experience using AWS EC2, ECS, CodeDeploy</li>\n<li>Frontend experience with Vue.js or similar</li>\n<li>TypeScript</li>\n<li>Experience with social media APIs</li>\n<li>UI/UX skills with a strong focus on using the Semantic UI framework for core components.</li>\n<li>Experience with the Semantic UI CSS framework</li>\n</ul><div>\n<strong><br />Ideal Candidate<br /></strong><br />\n</div><ul>\n<li>A great team player and communicator</li>\n<li>We’re seeking a team member we can trust and build a strong, friendly relationship with. We place equal importance on cultural fit and technical expertise</li>\n<li>We don’t expect you to know every framework or API, but we do look for someone who is eager to learn and can quickly adapt to new technologies</li>\n</ul><div>\n<strong><br />What We Offer<br /></strong><br />\n</div><ul>\n<li>Salary range $45,000 USD to $60,000 USD depending on experience</li>\n<li>Opportunity to get stock options in fast growing tech startup</li>\n<li>Bonuses</li>\n<li>Full time, fully remote position</li>\n<li>Flexible working hours</li>\n<li>Co-working space allowance</li>\n<li>Low meeting environment and flat team hierarchy</li>\n<li>Friendly team that welcomes feedback</li>\n<li>Great opportunity to have a big impact and for career development</li>\n<li>Meet up and work with the team in great locations around the world</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/brandchamp-senior-full-stack-javascript-engineer\">https://weworkremotely.com/remote-jobs/brandchamp-senior-full-stack-javascript-engineer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/brandchamp-senior-full-stack-javascript-engineer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Contra: Webflow Developer",
    "description": "<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://bit.ly/3kLhMdk\">http://bit.ly/3kLhMdk</a>\n</p>\n\n<div>Contra is looking for an experienced Webflow Developer to help build and optimize our online presence. This role involves collaborating with the design team to create responsive, high-performing web experiences.<br /><br />\n</div><div><strong>Responsibilities</strong></div><ul>\n<li>\n<strong>Develop &amp; Design:</strong> Build responsive Webflow templates and layouts.</li>\n<li>\n<strong>Ensure Performance:</strong> Optimize site speed and scalability.</li>\n<li>\n<strong>Collaborate:</strong> Work with designers to create a cohesive visual experience.</li>\n<li>\n<strong>Troubleshoot &amp; Improve:</strong> Identify and resolve Webflow-related issues.</li>\n<li>\n<strong>Document Work:</strong> Maintain clear development documentation.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/contra-webflow-developer-3\">https://weworkremotely.com/remote-jobs/contra-webflow-developer-3</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/contra-webflow-developer-3",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Contra: Framer Developer",
    "description": "<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://bit.ly/3kLhMdk\">http://bit.ly/3kLhMdk</a>\n</p>\n\n<div>Join Contra as a Framer Developer and play a key role in enhancing our networking platform. We’re looking for a skilled developer to create interactive user interfaces that elevate the user experience, all while contributing to our mission of empowering independent work.<br /><br />\n</div><div><strong>Responsibilities</strong></div><ul>\n<li>\n<strong>Develop Interactive Components:</strong> Build and implement dynamic, interactive elements using Framer, ensuring seamless user experiences.</li>\n<li>\n<strong>Collaborate with Design:</strong> Partner with the design team to transform creative concepts into functional, interactive features.</li>\n<li>\n<strong>Optimize Performance:</strong> Write efficient, clean code that maximizes platform performance across a wide range of devices and browsers.</li>\n<li>\n<strong>Ensure Feasibility:</strong> Evaluate the technical feasibility of UI/UX designs, ensuring they are practical and executable within the platform's architecture.</li>\n<li>\n<strong>Maintain &amp; Improve:</strong> Regularly update and enhance existing platform features, ensuring long-term functionality and scalability.</li>\n</ul><div>\n<br /><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/contra-framer-developer-2\">https://weworkremotely.com/remote-jobs/contra-framer-developer-2</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/contra-framer-developer-2",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Contra: Full-stack Engineer",
    "description": "<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://bit.ly/3kLhMdk\">http://bit.ly/3kLhMdk</a>\n</p>\n\n<div>Contra is looking for a <strong>skilled Full-stack Engineer</strong> to develop and maintain scalable, high-performance web applications. If you have experience in both front-end and back-end development and enjoy building seamless user experiences, we’d love to hear from you!<br /><br />\n</div><div><strong>Responsibilities:</strong></div><ul>\n<li>Develop, optimize, and maintain both front-end and back-end components of web applications.</li>\n<li>Collaborate with designers and product teams to implement user-friendly features.</li>\n<li>Write clean, maintainable, and efficient code.</li>\n<li>Ensure responsiveness, security, and performance across all platforms.</li>\n<li>Integrate APIs and third-party services to enhance application functionality.</li>\n<li>Debug and troubleshoot issues to improve system reliability.</li>\n</ul><div><strong>Requirements:</strong></div><ul>\n<li>Proven experience as a <strong>Full-stack Engineer</strong> with a strong portfolio or GitHub profile.</li>\n<li>Proficiency in <strong>JavaScript/TypeScript</strong> and front-end frameworks like <strong>React, Vue, or Angular.</strong>\n</li>\n<li>Back-end experience with <strong>Node.js, Python (Django/Flask), Ruby on Rails, or similar frameworks.</strong>\n</li>\n<li>Strong understanding of <strong>databases (PostgreSQL, MySQL, MongoDB, Firebase).</strong>\n</li>\n<li>Experience working with <strong>RESTful APIs, GraphQL, and authentication methods (OAuth, JWT).</strong>\n</li>\n<li>Knowledge of <strong>CI/CD pipelines and cloud services (AWS, Vercel, Netlify, Firebase).</strong>\n</li>\n<li>Strong problem-solving skills and ability to work independently.</li>\n</ul><div><strong>Nice to Have:</strong></div><ul>\n<li>Experience with Next.js, Nuxt.js, or SvelteKit.</li>\n<li>Familiarity with WebSockets and real-time applications.</li>\n<li>Knowledge of containerization (Docker, Kubernetes).</li>\n<li>Understanding of DevOps practices and infrastructure as code.</li>\n</ul><div><br /></div><div>🚀 If you're a Full-stack Engineer ready to build cutting-edge web applications, <strong>apply now!</strong>\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/contra-full-stack-engineer\">https://weworkremotely.com/remote-jobs/contra-full-stack-engineer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/contra-full-stack-engineer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Contra: Frontend Engineer",
    "description": "<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://bit.ly/3kLhMdk\">http://bit.ly/3kLhMdk</a>\n</p>\n\n<div>Contra is looking for a <strong>skilled Frontend Engineer</strong> to build and enhance user-friendly, high-performance web applications. If you have experience with modern JavaScript frameworks, responsive design, and creating seamless user experiences, we’d love to hear from you!<br /><br />\n</div><div><strong>Responsibilities:</strong></div><ul>\n<li>Develop and optimize scalable, responsive frontend applications.</li>\n<li>Collaborate with designers and backend developers to implement UI/UX designs.</li>\n<li>Write clean, maintainable, and well-documented code.</li>\n<li>Ensure cross-browser and mobile compatibility.</li>\n<li>Optimize performance for speed and scalability.</li>\n<li>Stay updated with the latest frontend technologies and best practices.</li>\n</ul><div><strong>Requirements:</strong></div><div>Proven experience as a <strong>Frontend Engineer</strong> with a strong portfolio.</div><ul>\n<li>Proficiency in <strong>JavaScript, TypeScript, React, Vue, or Angular.</strong>\n</li>\n<li>Strong understanding of <strong>HTML, CSS, and modern styling frameworks (Tailwind, SCSS, Styled Components, etc.).</strong>\n</li>\n<li>Experience with <strong>RESTful APIs, GraphQL, and state management (Redux, Zustand, Vuex, etc.).</strong>\n</li>\n<li>Knowledge of <strong>build tools (Webpack, Vite, Babel)</strong> and performance optimization techniques.</li>\n<li>Understanding of UI/UX principles and accessibility best practices.</li>\n<li>Strong problem-solving skills and ability to work independently.</li>\n</ul><div><strong>Nice to Have:</strong></div><ul>\n<li>Experience with Next.js, Nuxt.js, or SvelteKit.</li>\n<li>Familiarity with testing frameworks (Jest, Cypress, Testing Library).</li>\n<li>Knowledge of CI/CD pipelines and deployment (Vercel, Netlify, AWS).</li>\n<li>Basic backend experience (Node.js, Firebase, or similar).</li>\n</ul><div><br /></div><div>🚀 If you’re passionate about building interactive web applications, <strong>apply now!</strong>\n</div><div><br /></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/contra-frontend-engineer-3\">https://weworkremotely.com/remote-jobs/contra-frontend-engineer-3</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/contra-frontend-engineer-3",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Contra: Web Developer",
    "description": "<p>\n  <strong>Headquarters:</strong> San Francisco, CA\n    <br /><strong>URL:</strong> <a href=\"http://bit.ly/3kLhMdk\">http://bit.ly/3kLhMdk</a>\n</p>\n\n<div>Contra is looking for a <strong>skilled Web Developer</strong> to build and maintain high-performance websites. If you have experience in front-end and/or back-end development, a passion for clean code, and the ability to create seamless user experiences, we’d love to hear from you!<br /><br />\n</div><div><strong>Responsibilities:</strong></div><ul>\n<li>Develop, optimize, and maintain responsive websites and web applications.</li>\n<li>Collaborate with designers to bring UI/UX concepts to life.</li>\n<li>Write clean, scalable, and efficient code.</li>\n<li>Ensure cross-browser and mobile compatibility.</li>\n<li>Debug and troubleshoot issues to improve site performance.</li>\n<li>Stay updated with the latest web technologies and best practices.</li>\n</ul><div><strong>Requirements:</strong></div><ul>\n<li>Proven experience as a Web Developer with a strong portfolio.</li>\n<li>Proficiency in <strong>HTML, CSS, JavaScript, and a modern framework (React, Vue, or Angular).</strong>\n</li>\n<li>Experience with back-end technologies (Node.js, Python, PHP, or similar).</li>\n<li>Knowledge of databases (SQL, Firebase, MongoDB, etc.).</li>\n<li>Understanding of SEO principles and website optimization.</li>\n<li>Ability to work independently and meet deadlines.</li>\n</ul><div><strong>Nice to Have:</strong></div><div>Experience with headless CMS, Webflow, or WordPress.</div><ul>\n<li>Familiarity with API integrations and third-party services.</li>\n<li>Knowledge of cloud platforms (AWS, Vercel, Netlify).</li>\n</ul><div><br /></div><div>🚀 If you're a Web Developer eager to build innovative digital experiences, <strong>apply now!<br /></strong><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/contra-web-developer-2\">https://weworkremotely.com/remote-jobs/contra-web-developer-2</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/contra-web-developer-2",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "danzek.ai: Backend Engineering Consultant",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/6082/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Philadelphia, PA\n    <br /><strong>URL:</strong> <a href=\"http://danzek.ai\">http://danzek.ai</a>\n</p>\n\n<div>\n<strong><br />Backend Engineering Consultant<br /></strong><br />\n</div><div>Fully Remote | Part Time | Equity Based<br /><br />\n</div><div><br /></div><div>\n<strong>Roles and Responsibilities:<br /></strong><br />\n</div><div>The Backend Engineering Consultant will take requirements directly from the CTO, and independently design and develop robust, production grade solutions. This is an individual contributor role. The Engineer will be focused exclusively on design and development, not mentorship, cross training or management. Primary responsibilities include:<br /><br />\n</div><div>\n<strong>Develop Microservices using Python<br /></strong><br />\n</div><div>Our primary language is Python, and our API framework is FastAPI. The Engineer will spend much of their time designing, developing and extending Python modules to power the core logic of our graph.<br /><br />\n</div><div>\n<strong>Create and Deploy Containers using Docker and GH Actions<br /></strong><br />\n</div><div>We take a container-first approach, leveraging Docker to encapsulate our products for deployment to cloud infrastructure. We use GitHub Actions for CI/CD to target infrastructure such as ECR. The Engineer will create Dockerfiles and GH workflow files to define the necessary environment for each application and deploy it.<br /><br />\n</div><div>\n<strong>Create Infrastructure Across Cloud Providers using IaC<br /></strong><br />\n</div><div>Our product is intended to be used across all major cloud providers, e.g. AWS, GCP, Azure. As such, we leverage Terraform to declaratively define services across providers. You will create Terraform scripts which are capable of creating and manipulating infrastructure with complex configurations, across providers.<br /><br />\n</div><div>\n<strong><br />Requirements:<br /></strong><br />\n</div><div>\n<strong>Education and Relevant Experience<br /></strong><br />\n</div><div>M.S. or B.S. in a S.T.E.M. or quantitative field is highly preferred, however, it is not required. Relevant experience with proven contributions is the highest indicator of potential for success in our opinion. We’ll look for 10+ years in a range of job titles or roles that overlap with the Roles and Responsibilities section. A clean GitHub demonstrating related skills is most important. However, we understand that many professionals don’t have time to create or contribute to public facing repositories, so we encourage applications from Engineers without a robust portfolio.<br /><br />\n</div><div>\n<strong>Deliverable, Cost and Quality Mindset<br /></strong><br />\n</div><div>danzek.ai™ is a startup, as such, we must be extremely focused on balancing time, cost and quality. The Engineer will need to select libraries and services that are cheap, yet effective. The Engineer will also need to design solutions which are extensible and carefully selected regarding scope. Lastly, the Engineer will be expected to mitigate tech debt at all costs by focusing on best practices, modern patterns and careful implementation.<br /><br />\n</div><div>\n<strong>Trust and Integrity<br /></strong><br />\n</div><div>As a startup, our IP is extremely valuable. We expect the Engineer to keep our code and designs secret, treating them with the utmost care from an InfoSec perspective. We’re offering the Engineer equity, as such, they have a tangible interest in protecting their ownership.<br /><br />\n</div><div>\n<strong>Flexibility<br /></strong><br />\n</div><div>As a consultant, the Engineer may work on days and times that are most convenient for them, and performance will be based upon contributions, not hours worked. We also don’t measure performance in KPIs such as a SLOC, which are often decoupled from quality and tangible benefits.<br /><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/danzek-ai-backend-engineering-consultant\">https://weworkremotely.com/remote-jobs/danzek-ai-backend-engineering-consultant</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/danzek-ai-backend-engineering-consultant",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Motia: Cursor/Windsurf/Cline/Claude-Code Expert / Full-Stack Engineer",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/5965/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Austin, TX\n    <br /><strong>URL:</strong> <a href=\"https://motia.dev\">https://motia.dev</a>\n</p>\n\n<div>\n<strong><br />Position: AI-First Senior Full-Stack / DevOps Engineer (Open Source, MotiaHub, &amp; AI)<br /></strong><br />\n</div><div>\n<strong><br />Location:</strong> Remote-friendly<br /><strong>Type:</strong> Full-time<br /><br />\n</div><div>\n<strong><br /></strong>Job Posting: Senior AI-Assisted Developer for Motia<br /><br /><strong>About Motia</strong><br /><br />Motia is an open-source, event-driven agent framework that orchestrates multi-language “Steps” into dynamic agents and flows. Our Workbench empowers developers to visualize, debug, and refine these agents, while Motia-Hub, our enterprise production platform, enables one-command deployments, advanced observability, environment management, and analytics.<br /><br />We’re a driven startup aiming to unify everything from business process agents to AI-driven flows under a single, event-driven architecture. We value:<br /><br />Ownership &amp; Accountability: Inspired by Jocko Willink, we seek individuals who take full responsibility for their work and see it through—no excuses.<br />Embracing Challenges: Echoing JFK, we do this not because it is easy, but because it is hard—pushing our skills to deliver impactful solutions.<br />Pragmatic Decision Making: As a fast-moving company, we balance smart tradeoffs with robust, high-impact outcomes.<br /><br /><strong>Role Overview</strong><br /><br />We’re seeking an expert in Cursor, Windsurf, Claude-Code, and Cline to join our team and revolutionize how developers build and maintain Motia agents. You’ll focus on creating dotfiles (e.g., .cursor/) and a Motia Configuration Profile (MCP) to integrate these AI-assisted coding tools seamlessly into the Motia ecosystem. Your work will empower developers to craft and update agents and flows effortlessly, leveraging AI to boost productivity and precision.<br /><br /><strong>You’ll split your time between:</strong><br /><br />Building Agents and flows: You will be building agent and intelligent automations, open-sourcing them, updating docs and creating content to help get the word out about motia.<br />Open-Source Core &amp; Workbench: Enhancing Motia’s framework and tools with AI-driven development integrations.<br />Motia-Hub: Supporting production-grade features to ensure agents scale with observability and ease.<br /><br /><strong>Key Responsibilities</strong><br /><br />Building Agents and Intelligent Automations<br />Open Source, Workbench, &amp; AI Tool Integration<br />Develop and maintain dotfiles (e.g., .cursor/) and a Motia Configuration Profile (MCP) to optimize Cursor, Windsurf, Claude-Code, and Cline for creating/updating Motia agents and flows.<br />Strengthen the Node/TypeScript engine to support seamless AI-generated step integrations across languages (Python, Ruby, etc.).<br />Enhance the React + Vite-based Workbench UI with AI-assisted features—e.g., auto-generated flow templates and real-time debugging hints.<br />Motia-Hub &amp; Production Support<br />Collaborate on the Motia-Hub web application (front and back end) to integrate AI tool outputs into deployment, observability, and analytics workflows.<br />Drive orchestration enhancements (e.g., AWS, Kubernetes) to support AI-generated agents at scale.<br />Improve CI/CD pipelines to validate AI-crafted code, ensuring versioning and zero-downtime deployments.<br />A Typical Week Could Include:<br />Core: Build an MCP that auto-generates a Python-based AI agent step using Claude-Code, ensuring compatibility with Motia’s runtime.<br />Workbench: Add a Cursor-driven feature to suggest flow optimizations in the UI based on agent performance logs.<br />Hub: Design a deployment pipeline in Motia-Hub that tests Windsurf-generated agent updates with zero downtime.<br />DevOps: Tune automated QA checks to validate AI tool outputs, adding performance instrumentation for Motia-Hub analytics.<br />What We’re Looking For<br />Professional Experience<br />Minimum of 5 years in software development, with expertise in full-stack development and AI-assisted coding practices.<br />Proven track record of integrating AI tools (Cursor, Windsurf, Claude-Code, Cline) into development workflows.<br />Experience leading technical projects and collaborating with open-source communities.<br />Technical Skills<br />AI-Assisted Development Expertise:<br />Mastery of Cursor, Windsurf, Claude-Code, and Cline for code generation and optimization.<br />Experience creating dotfiles (e.g., .cursor/) and configuration profiles for developer tools.<br />Ability to design systems that leverage AI to streamline agent and flow creation.<br />Core Development:<br />Proficiency in Node.js and TypeScript, with skills in integrating Python, Ruby, and other languages.<br />Strong front-end skills with React and Vite, focused on building intuitive, AI-enhanced UIs.<br />DevOps &amp; Production:<br />Expertise in cloud services (AWS preferred) and Infrastructure as Code (e.g., CloudFormation, Terraform).<br />Hands-on experience with Docker, Kubernetes, and CI/CD tools (e.g., Jenkins, GitLab CI, CircleCI).<br />Scripting proficiency (Python, Perl, or Ruby) for automation tasks.<br />Open-Source Contributions<br />Active contributor to open-source projects, with a history of impactful code submissions and peer reviews.<br />Familiarity with Git, GitHub workflows, and community collaboration.<br />AI-Driven Agent Development<br />Proven experience using AI tools to build intelligent agents and flows from scratch.<br />Understanding of machine learning models and their integration into event-driven systems.<br />Ability to enhance agent functionality with AI-generated logic for adaptability and efficiency.<br />DevOps Expertise<br />Experience designing secure, scalable automation solutions for development and production environments.<br />Familiarity with observability tools (e.g., logging, monitoring) to ensure agent performance in Motia-Hub.<br />Soft Skills<br />High Ownership: You treat tasks like you own the outcome, proactively solving problems without hand-offs.<br />Hard Work &amp; Drive: You excel in tough challenges, from AI integration to production scaling.<br />Pragmatism: You balance long-term quality with startup speed, hitting milestones without over-engineering.<br />Our Culture &amp; Values<br />Team Unity: We brainstorm openly, review code together, and celebrate wins as a unit.<br />Fearless Exploration: We push boundaries with AI-driven agents and advanced orchestration—not settling for the ordinary.<br />Real-World Impact: Motia Core (open-source) and Motia-Hub (production) solve tough problems for real users—your work shapes ecosystems.<br />Why Join Us<br />Shape the Future: Help define how AI tools like Cursor and Claude-Code power agent development in an open-source and enterprise platform.<br />Ownership &amp; Growth: Design and build with real impact—your integrations will accelerate Motia’s adoption.<br />Respect for Craft &amp; Balance: We value robust systems and practical decisions to keep moving forward.<br />Open-Source Impact: Contribute to a global community, with your dotfiles and MCP benefiting developers worldwide.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/motia-cursor-windsurf-cline-claude-code-expert-full-stack-engineer\">https://weworkremotely.com/remote-jobs/motia-cursor-windsurf-cline-claude-code-expert-full-stack-engineer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/motia-cursor-windsurf-cline-claude-code-expert-full-stack-engineer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "ForceMetrics: Senior Software Engineer, Full Stack",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/4854/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> \n    <br /><strong>URL:</strong> <a href=\"https://www.forcemetrics.com\">https://www.forcemetrics.com</a>\n</p>\n\n<div>\n<br />To apply for this position, you must be a U.S. Citizen, you must currently live in the U.S., you must pass an FBI background check, and you must be willing to take a drug test.<br /><br />\n</div><div>\n<br />ForceMetrics™ mission is to transform data for social change. We’re striving to make a positive community impact by helping public safety and government agencies better utilize data to benefit every individual. By bringing data-driven innovation to dated systems and processes, ForceMetrics is empowering responders to make better, more informed decisions in the moment, ultimately working to solve some of the toughest societal problems. <br /><br />\n</div><div>\n<br />About the role</div><div>\n<strong>HOW YOU WILL HAVE IMPACT<br /></strong><br />\n</div><div>\n<br />We’re looking for a self-driven, mission-oriented Senior Full-Stack Developer to join us in building a powerful data search and analytics platform that transforms how public safety agencies and community organizations work together. Our platform enriches and synthesizes law enforcement datasets, helping to identify impactful engagement patterns, improve officer effectiveness, and optimize resource planning.<br /><br />\n</div><div>\n<br />As a key member of the ForceMetrics team, you’ll have hands-on involvement in designing and building our current and next-generation software products. Joining us at this early stage, you’ll have unique opportunities to shape our engineering practices, influence core technology decisions, and establish your own areas of expertise and ownership.<br /><br /><strong><br />WHAT YOU WILL DO<br /></strong><br />\n</div><ul>\n<li>Develop dynamic web applications with React (Next.js) and Python (Django)</li>\n<li>Design and build simple, intuitive, and powerful user experiences</li>\n<li>Write comprehensive tests to ensure the stability and reliability of our product</li>\n<li>Produce scalable, maintainable code for a secure, multi-tenant SaaS environment</li>\n<li>Engage in sprint planning, breaking down complex tasks and setting achievable goals</li>\n<li>Gain deep expertise in the ForceMetrics platform, leveraging its capabilities to address real-world challenges in public safety and community impact</li>\n</ul><div>\n<strong><br />WHAT YOU MUST HAVE<br /></strong><br />\n</div><ul>\n<li>5+ years of experience with advance Elasticsearch experience building search queries and aggregations.</li>\n<li>Proficient in JavaScript and Python, with experience in frameworks like React, Next.js, or Vue.js</li>\n<li>Experienced in CSS frameworks like Tailwind, Bootstrap, or Material Design to create visually appealing, responsive interfaces</li>\n<li>Strong communication skills, able to clearly convey technical topics to both technical and non-technical stakeholders</li>\n<li>Collaborative mindset with a strong desire to work cross-functionally and contribute meaningfully to a team</li>\n<li>Growth-oriented, open to feedback and committed to continuous learning and improvement</li>\n<li>Proactive problem solver, eager to take initiative and deliver results in a fast-paced, lean environment</li>\n<li>Desire to work on a lean, fast-paced team where you can take initiative and produce results every day</li>\n<li>U.S. Citizen (or Green Card Holder) able to pass an FBI background check in order to work with the highly sensitive data entrusted to us to positively impact the world<br /><br />\n</li>\n</ul><div>\n<strong>WHAT WILL MAKE YOU STAND OUT<br /></strong><br />\n</div><ul>\n<li>Early-stage tech startup experience</li>\n<li>Passion for making a difference in the lives of many</li>\n<li>Past exposure to law enforcement, public safety, or to similar data systems</li>\n<li>Computer Science or Engineering degree from 4-year accredited university</li>\n<li>Experience with object-oriented design and software design patterns</li>\n<li>Experience with backend like Django, Flask, CherryPy, Spring, or Spring Boot</li>\n<li>Proficiency with Relational Databases (i.e Postgres, MySQL, Microsoft SQL, etc)</li>\n<li>Mobile application development like iOS, Android, React Native</li>\n<li>Experience with Docker, Kubernetes, or CI/CD</li>\n<li>Prior experience working on an Agile/Scrum team<br /><br />\n</li>\n</ul><div>\n<strong>WHAT WE CAN OFFER<br /></strong><br />\n</div><ul>\n<li>A strong sense of mission for impacting real communities and solving complex societal problems</li>\n<li>Work alongside other top talent in a rewarding and enjoyable culture</li>\n<li>Company Equity </li>\n<li>Medical, Dental, Vision &amp; Life insurance</li>\n<li>401(k)</li>\n<li>100% Remote</li>\n<li>Standard holidays and paid time off</li>\n<li>Salary range for this position is: $130K to $170K + DOE</li>\n</ul><div>\n<strong><br /></strong><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/forcemetrics-senior-software-engineer-full-stack\">https://weworkremotely.com/remote-jobs/forcemetrics-senior-software-engineer-full-stack</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/forcemetrics-senior-software-engineer-full-stack",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Lemon.io: Senior Full-stack Developer (remote, U.S.)",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0076/3337/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> New York, NY\n    <br /><strong>URL:</strong> <a href=\"https://lemon.io\">https://lemon.io</a>\n</p>\n\n<div>Are you a talented Senior Developer looking for a remote job that lets you show your skills and get decent compensation? Look no further than <a href=\"https://lemon.io/for-developers/?utm_source=weworkremotely&amp;utm_medium=job_ad&amp;utm_campaign=supply_en_react/python/node_us_only_feb_2025_job_ad%20\">Lemon.io</a> — the marketplace that connects you with hand-picked startups in the US and Europe.</div><div><strong><br />What we offer:</strong></div><ul>\n<li>Earn $9.4k - $28.4k monthly:  the rate depends on your seniority level, skills and experience. We've already paid out over $11M to our engineers.</li>\n<li>No more hunting for clients or negotiating rates — let us handle the business side of things so you can focus on what you do best.</li>\n<li>We'll manually find the best project for you according to your skills and preferences.</li>\n<li>Choose a schedule that works best for you. It’s possible to communicate async or minimally overlap within team working hours.</li>\n<li>We respect your seniority so you can expect no micromanagement or screen trackers.</li>\n<li>Communicate directly with the clients. Most of them have technical backgrounds. Sounds good, yeah?</li>\n<li>We will support you from the time you submit the application throughout all cooperation stages.</li>\n<li>Most of our projects involve working in a fast-paced startup environment. We hope you like it as much as we do.</li>\n<li>Through our community, we will connect you with the best developers from more than 50 countries.</li>\n</ul><div><strong>Requirements:</strong></div><ul>\n<li>4+ years of software development experience.</li>\n<li>3+ years of commercial experience with React.js.</li>\n<li>3+ years of commercial experience with Python AND/OR 4+ years of experience with Node.js.</li>\n<li>For React &amp; Python Developer: hands-on experience with Next.js, PostgreSQL would be a plus, 3+ years of experience with AWS and TypeScript is a must</li>\n<li>For React &amp; Node Developer: hands-on experience with AWS, Next.js, TypeScript is a must.<br /><br />\n</li>\n<li>Strong technical skills: as a Senior Developer, you are expected to be able to create projects from scratch and have a deep understanding of application architecture.</li>\n<li>Clear and effective communication in English — advanced ability to discuss business tasks, justify decisions, and communicate issues. Good self-presentation is also essential for upcoming client calls.</li>\n<li>Strong self-organizational skills — ability to work full-time remotely with no supervision.</li>\n<li>Reliability — we want to trust you and expect that you won’t let us and the client down.</li>\n<li>Adaptability and Flexibility — the ability to onboard the project promptly after accepting it and start delivering results quickly.</li>\n</ul><div>Sounds good for you? Apply now and join the <a href=\"https://lemon.io/for-developers/?utm_source=weworkremotely&amp;utm_medium=job_ad&amp;utm_campaign=supply_en_react/python/node_us_only_feb_2025_job_ad%20\">Lemon.io</a> community!<br /><br />\n</div><div><strong>NOT YOUR TECH STACK?</strong></div><div>\n<br />We have different projects for Senior Developers, so if you have 4+ years of commercial experience in software development and you are fluent with AI Engineering, we would be happy to communicate and provide you with a project that matches your experience. Just apply, and we will share more details with you.</div><div><strong><br />If your experience matches our requirements, be ready for the next steps:</strong></div><ul>\n<li>VideoAsk — watch a short video about our startup, up to 10 minutes</li>\n<li>Complete your profile on our website</li>\n<li>30-minute screening call</li>\n<li>Technical interview</li>\n<li>Feedback</li>\n<li>Magic Box (we are looking for the best project for you).</li>\n</ul><div>We do not provide visa assistance, and our cooperation model does not include the benefits typically offered with direct hire.<br /><br />\n</div><div>Do you represent a company with engineers who match the description and want to collaborate with us through staff augmentation? Then register <a href=\"https://lemon.io/for-developers/?utm_source=weworkremotely&amp;utm_medium=job_ad&amp;utm_campaign=supply_en_react/python/node_us_only_feb_2025_job_ad%20\">here</a>.</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/lemon-io-senior-full-stack-developer-remote-u-s\">https://weworkremotely.com/remote-jobs/lemon-io-senior-full-stack-developer-remote-u-s</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/lemon-io-senior-full-stack-developer-remote-u-s",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Speechify Inc: Senior Software Engineer, Web",
    "description": "<p>\n  <strong>Headquarters:</strong> Florida\n    <br /><strong>URL:</strong> <a href=\"http://www.speechify.com\">http://www.speechify.com</a>\n</p>\n\n<div>\n<strong><br />Overview<br /></strong><br />\n</div><div>With that growth comes the need for a Javascript Engineer to join the existing Web team and continue supporting the growing user base as well as building new and exciting features.</div><div><br /></div><div>This is a key role and ideal for someone who thinks strategically, enjoys high-pace environments, passionate about owning product decisions and has experience building and scaling complex engineering systems.</div><div>\n<strong><br />What You’ll Do<br /></strong><br />\n</div><ul>\n<li>Actively ship production code to the web products</li>\n<li>Work closely with your dedicated product team</li>\n<li>Participate in product discussions to shape the product roadmap</li>\n<li>Have the opportunity to work on new and exciting features that will impact millions of lives</li>\n</ul><div>\n<strong><br />An Ideal Candidate Should Have<br /></strong><br />\n</div><ul>\n<li>Experience. You've built and ship products that have scaled to thousands or millions of users</li>\n<li>Customer obsession. You are passionate about the field and have the desire to build high quality product that serves customer needs</li>\n<li>Speed. You work quickly to generate ideas and know how to decide which things can ship now and what things need time</li>\n<li>Focus. We’re a high-growth startup with a busy, remote team. You know how and when to engage or be heads down</li>\n<li>Collaboration. You know how to inspire, play, and negotiate with opinionated designers, marketers, and PMs</li>\n<li>Tech Stack: Vanilla JS, ReactJS, Redux, Firebase, Typescript</li>\n</ul><div>\n<strong><br />What We Offer<br /></strong><br />\n</div><ul>\n<li>A fast-growing environment where you can help shape the culture</li>\n<li>An entrepreneurial crew that supports risk, intuition, and hustle</li>\n<li>A hands-off approach so you can focus and do your best work</li>\n<li>The opportunity to make an impact in a transformative industry</li>\n<li>A competitive salary, a collegiate atmosphere, and a commitment to building a great asynchronous culture</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/speechify-inc-senior-software-engineer-web\">https://weworkremotely.com/remote-jobs/speechify-inc-senior-software-engineer-web</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/speechify-inc-senior-software-engineer-web",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "AutoGPT: Senior Frontend Engineer at AutoGPT",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/4827/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> UK\n    <br /><strong>URL:</strong> <a href=\"http://agpt.co\">http://agpt.co</a>\n</p>\n\n<div><strong>About AutoGPT ✌🏼</strong></div><div><br /></div><div>\n<br />At <strong>AutoGPT, we are on a mission to democratize AI</strong> by providing powerful digital assistants (agents) to everyone. Our platform is designed to empower businesses, level the playing field, and drive innovation with autonomous AI. We are building an open-source, AI-driven ecosystem that simplifies complex tasks and workflows. With our global community, we're working to make AI accessible and impactful for all users, regardless of their technical background.</div><div><br /></div><div>\n<strong><br />Our Product 🛠️<br /></strong><br />\n</div><ul>\n<li>\n<strong>AutoGPT Marketplace</strong>: A marketplace where users can explore and build innovative AI agents.</li>\n<li>\n<strong>AutoGPT Builder</strong>: A graph-based, infinite canvas front-end that allows users to create agents using nodes, designed for non-technical users.</li>\n<li>\n<strong>AutoGPT Server</strong>: The infrastructure that powers AI assistants, automating tasks reliably and efficiently.</li>\n<li>\n<strong>AutoGPT Agent Library</strong>: A dashboard for managing and monitoring the performance of AI agents, giving users control and transparency. </aside></li>\n</ul><div><strong><br />The Role 🙌🏼</strong></div><div>\n<br /><br />\n</div><div>\n<br />As a <strong>Contract Frontend Engineer</strong>, you will play a pivotal role in building the user-facing portions of our AI Agent platform. This includes developing dynamic, responsive, and intuitive interfaces using the latest frontend technologies. You’ll be working alongside a talented team of engineers, designer, and product manager to create a seamless experience for both technical and non-technical users.<br /><br />\n</div><div>\n<strong><br />What You'll Achieve:<br /></strong><br />\n</div><ul>\n<li>Develop and maintain frontend features for AutoGPT’s marketplace, agent builder, and agent library using <strong>Next.js</strong>, <strong>React</strong>, and <strong>Tailwind CSS</strong>.</li>\n<li>Collaborate closely with the design team to integrate <strong>Figma</strong> designs into <strong>functional, user-friendly components</strong>, ensuring a refined user interface and smooth web animations (e.g., confetti for onboarding screens, or transitions) to enhance the product's polish.</li>\n<li>Enhance user experience by optimizing the performance, accessibility, and scalability of the platform.</li>\n<li>Work on the integration of backend systems, familiar with <strong>Python</strong>, <strong>Prisma</strong>, and <strong>Supabase</strong>, to ensure smooth interactions between the frontend and backend.</li>\n<li>Contribute to building and maintaining a <strong>design system</strong> to ensure consistency and high quality across all UI components.</li>\n<li>Help make AI programming and agent management accessible to a wider audience by creating intuitive, visually appealing interfaces for non-technical users.</li>\n</ul><div>\n<strong><br />Skills You'll Need:<br /></strong><br />\n</div><ul>\n<li>Proficiency with <strong>Next.js</strong> and <strong>React</strong> for building dynamic web applications.</li>\n<li>Experience with <strong>Tailwind CSS</strong> to create responsive and reusable UI components.</li>\n<li>Familiarity with <strong>Python</strong>, <strong>Prisma</strong>, and <strong>Supabase</strong> for backend integrations.</li>\n<li>Experience working with <strong>Figma</strong> to collaborate on designs and implement them in code.</li>\n<li>Strong understanding of web performance optimization, accessibility standards, and best practices.</li>\n<li>A collaborative approach to problem-solving, working with cross-functional teams in a remote-first environment.</li>\n</ul><div>\n<strong><br />Nice to Haves:<br /></strong><br />\n</div><ul>\n<li>A passion for AI and its potential to change the world.</li>\n<li>\n<strong>Polished design sensibility</strong>: an understanding of design polish to ensure a refined, user-friendly interface.</li>\n<li>Experience with <strong>shadcn</strong> or similar design systems.</li>\n<li>Previous work on <strong>open-source projects</strong> or in start-up environments.</li>\n</ul><div>\n<strong><br />Why Join Us:<br /></strong><br />\n</div><ul>\n<li>Be part of a mission-driven company focused on democratizing AI and empowering businesses.</li>\n<li>We value <strong>empathy for our users, colleagues, and ourselves</strong> to build a supportive and sustainable work environment.</li>\n<li>Work on an exciting, innovative product that is shaping the future of AI accessibility.</li>\n<li>Join a highly collaborative and globally distributed team.</li>\n<li>Contribute to an open-source project with immediate user feedback and rapid iteration.</li>\n</ul><div>\n<strong><br />Details:<br /></strong><br />\n</div><ul>\n<li>\n<strong>Role</strong>: Contract (with potential for long-term collaboration)</li>\n<li>\n<strong>Remote</strong>: Fully remote and asynchronous</li>\n<li>\n<strong>Start Date</strong>: Immediate</li>\n<li>\n<strong>Compensation</strong>: Competitive, based on experience</li>\n</ul><div><br /></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/autogpt-senior-frontend-engineer-at-autogpt\">https://weworkremotely.com/remote-jobs/autogpt-senior-frontend-engineer-at-autogpt</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/autogpt-senior-frontend-engineer-at-autogpt",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Yooli: FULL TIME: Software Engineer Position - React and Rest",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0161/6774/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Australia\n    <br /><strong>URL:</strong> <a href=\"http://yooli.co\">http://yooli.co</a>\n</p>\n\n<div><strong>Job description</strong></div><ul>\n<li>We are seeking a highly skilled <strong>Senior Software Engineer</strong> to join our team and contribute to the transformative tech evolution in healthcare. </li>\n<li>This critical role involves developing, integrating, and optimising our backend and database systems. </li>\n<li>You will work closely with our Chief Engineer and CTO to build and refine our software solutions, ensuring they remain at the cutting edge of innovation.</li>\n</ul><div><br /></div><div><strong>Your Role:</strong></div><ul>\n<li>Develop and maintain robust backend services using <strong>NestJS</strong> and <strong>Node.js</strong>, ensuring top-tier performance and security.</li>\n<li>Design and manage efficient <strong>REST API</strong> endpoints to optimise interactions with our SQL database.</li>\n<li>Collaborate with cross-functional teams to define, design, and deploy new features, focusing on backend logic and database performance.</li>\n<li>Ensure the scalability, security, and responsiveness of backend services.</li>\n<li>Uphold rigorous data protection standards and implement industry-leading security measures.</li>\n<li>Participate in code reviews to uphold high coding standards and foster continuous improvement within the development team.</li>\n</ul><div><br /></div><div><strong>What Youll Bring:</strong></div><div><strong>Essential Skills &amp; Experience:</strong></div><ul>\n<li>At least <strong>7 years of experience</strong> with:</li>\n<li><strong>React</strong></li>\n<li><strong>React Vite</strong></li>\n<li><strong>REST API development</strong></li>\n<li>Strong knowledge and hands-on experience with <strong>SQL</strong>.</li>\n<li>Proficiency in <strong>Prisma</strong> for database management.</li>\n<li>A minimum of <strong>5 years of experience</strong> in <strong>REST API development</strong> using the <strong>NestJS framework</strong>.</li>\n<li>Expertise in backend development, specifically with <strong>NestJS</strong>, <strong>Node.js</strong>, <strong>REST APIs</strong>, and <strong>PostgreSQL</strong>.</li>\n<li>Experience in developing single-page applications using <strong>ReactJS</strong>.</li>\n<li>Strong understanding of <strong>TypeScript</strong> and <strong>Object-Oriented Programming (OOP)</strong> principles.</li>\n<li>Solid grasp of commonly used <strong>data structures</strong>.</li>\n<li>Proven experience with <strong>cloud hosting services</strong> (preferably AWS) and integrating them into development workflows.</li>\n<li>Exceptional problem-solving skills and meticulous attention to detail.</li>\n<li>A proven ability to thrive in collaborative, remote work environments, showcasing excellent communication skills and a commitment to team success.</li>\n<li>A portfolio demonstrating relevant projects.</li>\n</ul><div><br /></div><div><strong>Nice-to-Haves:</strong></div><ul>\n<li>Experience with <strong>CI/CD pipelines</strong> and version control systems like <strong>Git</strong>.</li>\n<li>Familiarity with <strong>agile development methodologies</strong> and project management tools.</li>\n<li>Knowledge of <strong>Redux</strong> for state management.</li>\n<li>A degree in <strong>Computer Science</strong> or a related field.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/yooli-full-time-software-engineer-position-react-and-rest\">https://weworkremotely.com/remote-jobs/yooli-full-time-software-engineer-position-react-and-rest</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/yooli-full-time-software-engineer-position-react-and-rest",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Subscript: Software Engineer (Frontend, Backend, or Full stack)",
    "description": "<p>\n  <strong>Headquarters:</strong> USA\n    <br /><strong>URL:</strong> <a href=\"https://www.subscript.com\">https://www.subscript.com</a>\n</p>\n\n<div>The basics<br /><br />\n</div><ul>\n<li>The <strong>stack</strong>: Postgres, Node.js/Express.js, React. Currently running on Heroku, eventually AWS</li>\n<li>The <strong>product</strong>: We're building the ultimate suite for Finance teams to manage everything from billing to revenue recognition to subscription metrics, and much more</li>\n<li>The <strong>way we work</strong>:<ul>\n<li>This is a <strong>remote job</strong> - work anywhere you want, and in any timezone on earth (or outside earth, whatever).</li>\n<li>We are an <strong>asynchronous</strong> team - we don't do scheduled meetings, and rely on each team member to pick their own schedule and to communicate clearly in writing and with recorded videos. <a href=\"https://www.loom.com/share/1b92593aaf5f41abb2450869085dc3a5\"><strong>Hear from our co-founder Michelle Lee on what it's like to work asynchronously (click here)</strong>.</a>\n</li>\n<li>We operate completely <strong>autonomously</strong> - no one will tell you what to do, we'll just tell you the goals and you will figure out how to work towards them with the rest of the team.</li>\n</ul>\n</li>\n<li>The <strong>role you'll play</strong> on our team:<ul>\n<li>You'd be one of the <strong>first ten</strong> engineers on the team.</li>\n<li>You'll <strong>work on</strong><ul>\n<li>Backend: database design and implementation, complex data management problems, API design and implementation, writing tests</li>\n<li>Frontend: building features in our react app, HTML/CSS + styled components, building amazing user experiences, writing tests</li>\n<li>Frontend and backend: building and iterating on our product, collaborating with designers and founders, and making a product that users will love.</li>\n</ul>\n</li>\n</ul>\n</li>\n<li>Like all start-ups we're scrappy, but not scrappy on compensation: Subscript is committed to paying our awesome team members at <strong>market-rate, including benefits.</strong>\n</li>\n</ul><div><br /></div><div>\n<strong>Our interview process<br /></strong><br />\n</div><div>Our interview process is designed to focus on <strong>your skills</strong> as a software engineer, and your ability to <strong>communicate clearly</strong>. We're a fully asynchronous company, so that's how we will communicate in this interview process too 🙂.<br /><br />\n</div><ol>\n<li>We'll ask you to work on a small code challenge</li>\n<li>After reviewing the short code challenge, we'll ask you to work on a <strong>~90 minute exercise </strong>while recording a loom (or other screen recording) video.</li>\n<li>If the video interview above goes well, we'll want to learn a bit more about <strong>how you communicate in writing</strong> - we will ask you to put together a <strong>technical design document</strong>. This is one of the biggest ways we communicate at Subscript, so we want to see that you can work well with that!</li>\n</ol><div>And finally, hopefully we'll send you an offer. And hopefully you'll accept!<br /><br />\n</div><div>\n<strong>Requirements<br /></strong><br />\n</div><ul>\n<li>You're an excellent engineer (you write high quality code, you write great tests, you ship quickly)</li>\n<li>You're a great communicator via writing, and via recorded videos.</li>\n<li>You're excited about working on a globally-distributed and diverse team, in an incredibly unique culture where autonomy, accountability, and ownership are equally as valued as your skillset.</li>\n<li>That's it!</li>\n</ul><div>\n<strong>Benefits<br /></strong><br />\n</div><ul>\n<li>Unlimited vacation</li>\n<li>Completely flexible work schedule - work literally anytime (and anywhere) you want!</li>\n<li>Benefits appropriate to your location (health/dental/vision in the USA)</li>\n<li>Company wide retreats multiple times per year</li>\n<li>Like all start-ups we're scrappy, but not scrappy on compensation: Subscript is committed to paying our awesome team members at market-rate, including benefits.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/subscript-software-engineer-frontend-backend-or-full-stack-2\">https://weworkremotely.com/remote-jobs/subscript-software-engineer-frontend-backend-or-full-stack-2</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/subscript-software-engineer-frontend-backend-or-full-stack-2",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "Platform Engineering Labs: Senior Software Engineer - GoLang",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/0913/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> New York\n    <br /><strong>URL:</strong> <a href=\"https://platform.engineering\">https://platform.engineering</a>\n</p>\n\n<div>We're seeking a Senior Software Engineer with deep Golang, UNIX, and cloud (AWS/GCP/Azure) expertise to join our dynamic team.<br /><br />You will:</div><ul>\n<li>Develop Golang backend services.</li>\n<li>Architect cloud-native solutions.</li>\n<li>Work full-stack.</li>\n<li>Work on Open Source</li>\n</ul><div>You Have:</div><ul>\n<li>7+ years Golang experience.</li>\n<li>Strong UNIX/Linux skills.</li>\n<li>Experience with different databases and distributed systems</li>\n<li>Cloud platform (AWS/GCP/Azure) expertise.</li>\n<li>API/microservices experience.</li>\n<li>Containerization (Docker/Kubernetes) knowledge.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/platform-engineering-labs-senior-software-engineer-golang\">https://weworkremotely.com/remote-jobs/platform-engineering-labs-senior-software-engineer-golang</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/platform-engineering-labs-senior-software-engineer-golang",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "LatHire: Shopify Developer",
    "description": "<img src=\"https://we-work-remotely.imgix.net/logos/0165/0721/logo.gif?ixlib=rails-4.0.0&amp;w=50&amp;h=50&amp;dpr=2&amp;fit=fill&amp;auto=compress\" />\n\n<p>\n  <strong>Headquarters:</strong> Delaware, United States\n    <br /><strong>URL:</strong> <a href=\"https://www.lathire.com\">https://www.lathire.com</a>\n</p>\n\n<div>We are currently seeking an experienced Shopify Developer to join our US-based team.<br /><br />In this role, you will:</div><ul>\n<li> Develop and maintain our Shopify storefront, ensuring high performance and responsive applications on desktop and mobile devices.</li>\n<li> Design and create Shopify themes tailored to our business needs.</li>\n<li> Implement SEO strategies to increase website visibility.</li>\n<li> Collaborate with our marketing and sales team to implement and drive eCommerce strategies.</li>\n<li> Execute on all phases of the development life cycle.</li>\n<li> Work with UX and Ul Designers to translate technical concepts into user-friendly web experiences.</li>\n<li> Handle technical issues related to web development and integration of different tools.</li>\n</ul><div>\n<br />Essential skills and qualifications:</div><ul>\n<li> Minimum of 2-3 years of experience as a Shopify Developer.</li>\n<li> Proficiency in HTML, CSS,  JavaScript, and Liquid.</li>\n<li> Strong grasp of responsive web design techniques.</li>\n<li> Understanding of SEO principles and implementation.</li>\n<li> Experience in user experience and user interface design.</li>\n<li> Excellent verbal and written communication skills in fluent English.</li>\n</ul>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/lathire-shopify-developer\">https://weworkremotely.com/remote-jobs/lathire-shopify-developer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/lathire-shopify-developer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "OnTheGoSystems: RoR&AWS Developer",
    "description": "<p>\n  <strong>Headquarters:</strong> 100% remote\n    <br /><strong>URL:</strong> <a href=\"https://onthegosystems.com\">https://onthegosystems.com</a>\n</p>\n\n<div><strong>We are looking for a talented developer to join our team. In this role, you’ll have an opportunity to contribute to both the development and operational sides of our projects, ensuring that our systems are scalable, reliable, and efficient.</strong></div><h1><strong>A few words about us</strong></h1><div>At OnTheGoSystems, we create innovative software powering over 1.5 million websites worldwide. Since 2008, we’ve built a fully remote team of 100+ talented specialists. In 2025, we’re launching a new cloud-based SaaS solution set to serve millions globally.</div><h1><strong>What strong skills we’re looking for in our developer</strong></h1><ul>\n<li>\n<strong>Ruby on Rails</strong>, </li>\n<li>Experience with <strong>React</strong>,</li>\n<li>Experience in <strong>AWS, ECS, Terraform</strong>,</li>\n<li>Experience with high-volume systems,</li>\n<li>Experience with automatic scaling and delayed jobs,</li>\n<li>Intensive database work,</li>\n<li>Writing and running automated tests,</li>\n<li>Proficiency in version control with Git,</li>\n<li>CI/CD experience – GitLab/Jenkins or another similar tool,</li>\n<li>Ability to debug complex code</li>\n</ul><h1><strong>Our ideal candidate is</strong></h1><ul>\n<li>Passionate about working in a startup environment and excited by new challenges.</li>\n<li>Customer-Focused.</li>\n<li>Result-Oriented.</li>\n<li>Problem-Solver. </li>\n<li>Accountable and Attentive to Detail.</li>\n<li>Proactive.</li>\n<li>Collaborative. </li>\n</ul><h1><strong>What you will do</strong></h1><div>You’ll participate in planning, implementing, managing infrastructure, maintaining systems, and automating tests.</div><h1><strong>What we offer</strong></h1><ul>\n<li>100% remote position,</li>\n<li>Body And Mind Movement (BAMM) program to support your physical activities and other hobbies, </li>\n<li>A computer budget to make your workplace better,</li>\n<li>A Kindle device with an access to our company Amazon account, </li>\n<li>We respect national holidays in each country and want you to have a rest these days, </li>\n<li>Being part of a team of smart, self-driven individuals,</li>\n<li>Great opportunity to progress and advance,</li>\n<li>Collaborating with team members across the globe.</li>\n</ul><div><br /></div><div><strong>If you’re looking for an excellent opportunity to make an impact, at a company that values innovation and teamwork, apply today and join our professional team!</strong></div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/onthegosystems-ror-aws-developer\">https://weworkremotely.com/remote-jobs/onthegosystems-ror-aws-developer</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-ror-aws-developer",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "OnTheGoSystems: Full-Stack Developer",
    "description": "<p>\n  <strong>Headquarters:</strong> 100% remote\n    <br /><strong>URL:</strong> <a href=\"https://onthegosystems.com\">https://onthegosystems.com</a>\n</p>\n\n<div>OntheGoSystems is looking for senior developers to build products that over 250,000 happy clients use every day. We write PHP and React code and fully cover it by automated tests. We pay close attention to design, usability, performance and security. If this sounds like yourself, we want to meet.</div><h1><strong>Must have strong skills in</strong></h1><ul>\n<li>Strong skills in <strong>PHP, JS</strong>,</li>\n<li>\n<strong>React and Redux</strong> experience,</li>\n<li>Expertise in <strong>databases</strong>,</li>\n<li>Proficiency in writing and applying <strong>automated tests</strong> with PHPUnit,</li>\n<li>Experience in writing End to End tests,</li>\n<li>Proficiency in version control with <strong>Git</strong>,</li>\n<li>Software architecture design, design patterns.</li>\n</ul><h1><strong>Nice-to-have skills</strong></h1><ul>\n<li>CI configuration/management,</li>\n<li>Experience with WordPress,</li>\n<li>Experience with Codeception,</li>\n<li>Functional programming experience.</li>\n</ul><h1><strong>What you will do</strong></h1><ul>\n<li>Build and maintain key features for WPML, ensuring they are reliable and perform well.</li>\n<li>Work with other teams to design and develop new features and improvements.</li>\n<li>Solve technical problems and make sure the code is clean, efficient, and scalable.</li>\n<li>Take charge of your projects from start to finish, managing your time and priorities effectively.</li>\n<li>Help improve our development process and suggest ways to make things more efficient.</li>\n</ul><h1><strong>Our expectations </strong></h1><ul>\n<li>\n<strong>Code Quality</strong>: Write clean, well-documented code that meets company standards.</li>\n<li>\n<strong>Test Coverage</strong>: Ensure the code is covered by automated tests.</li>\n<li>\n<strong>Meaningful Logs</strong>: Provide clear, insightful logs to track system performance.</li>\n<li>\n<strong>Continuous Improvement</strong>: Learn new skills, improve processes, and contribute to team growth.</li>\n</ul><h1><strong>What we offer</strong></h1><ul>\n<li>100% remote position,</li>\n<li>Body And Mind Movement (BAMM) program to support your physical activities and other hobbies, </li>\n<li>A computer budget to make your workplace better,</li>\n<li>A Kindle device with an access to our company Amazon account, </li>\n<li>We respect national holidays in each country and want you to have a rest on those days, </li>\n<li>Being a part of a team of smart, self-driven individuals,</li>\n<li>Great opportunity to progress and advance,</li>\n<li>Collaborating with team members across the globe.</li>\n</ul><div><br /></div><div>If it sounds interesting to you, <strong>apply today</strong> and we are looking forward to getting to know you better!<br /><br />\n</div>\n\n<p><strong>To apply:</strong> <a href=\"https://weworkremotely.com/remote-jobs/onthegosystems-full-stack-developer-4\">https://weworkremotely.com/remote-jobs/onthegosystems-full-stack-developer-4</a></p>",
    "url": "https://weworkremotely.com/remote-jobs/onthegosystems-full-stack-developer-4",
    "platform": "weworkremotely.com",
    "source": "rss"
  },
  {
    "title": "[Hiring] Searching for a team of developers",
    "description": "Hey everyone,\nWith a team of 3 we have set out to create a startup. We are in search of programmers to first build our website, and then our app. Due to us only creating our minimal viable product, we will only be in search of 3 roles being:\n1 front-end developer, 1 back-end developer, and 1 project manager. The website is not a grand project just yet, but we are searching for a team that we can trust in the future and hopefully hire permanently, with an American salary if successful. We are a small startup, with not much capital, so we will be seeking to outsource our work outside of the USA. Philippines, Singapore, India, everywhere, feel free to apply but don't expect USA pay for an outsourced job. Employees will be compensated rightfully so for grade of their work and where their work is located out of. Applications will be graded on experience, leadership, communication, and expected pay. Work won't exceed at the start from 14-20 hours a week per employee, and hours will be flexible, but all 3 employees will have to be working at the same time.\nDm me and we will discuss further details. The team looks forward to working with you.\n-FOBS USA",
    "url": "https://www.reddit.com/r/forhire/comments/1jj0dlo/hiring_searching_for_a_team_of_developers/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  },
  {
    "title": "[HIRING] Looking for agency to post Reddit content",
    "description": "I am looking for any tyoe of official body who can post a number Reddit updates in a given days. The budget is around Rs. 1 lakh/45 days for the project. Goal is to get a bifurcated amount from the budget based on number of updates provided.",
    "url": "https://www.reddit.com/r/forhire/comments/1jiz4ey/hiring_looking_for_agency_to_post_reddit_content/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  },
  {
    "title": "[Hiring] app developers needed urgently",
    "description": "We’re looking to hire and are paying above $15 an hour. If you’re interested, please drop examples of your work in the comments or DM me them\n\nLooking forward to seeing what you’ve created ",
    "url": "https://www.reddit.com/r/forhire/comments/1jix9oc/hiring_app_developers_needed_urgently/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  },
  {
    "title": "[HIRING] - Long Term Position Relisting FB Marketplace &amp; Kijiji Ads",
    "description": "Need someone who is able list second hand items on platforms like Facebook marketplace and Kijiji in addition to relisting those ads and existing ads on a regular basis. It’s quite easy work just a bit a tedious and repetitive. I will provide images of the items and a template of the description that just needs to be adjusted based on the items. \n\nThere’s quite a few items and many new items I need listed so I’d imagine it’ll take a few hours a day.\n\nLooking for someone long term and dedicated. Can discuss pay. For more details please pm me. ",
    "url": "https://www.reddit.com/r/forhire/comments/1jivdte/hiring_long_term_position_relisting_fb/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  },
  {
    "title": "[HIRING] Product Lister – $20 Per Listing",
    "description": "Hey everyone,\n\nI'm looking for a **detail-oriented Product Lister** to help create and optimize product listings for e-commerce platforms. This role involves adding product details, writing clear descriptions, and ensuring accurate formatting.\n\n# Requirements:\n\n✅ Experience listing products on **E-commerce platforms**  \n✅ Strong **attention to detail** and accuracy  \n✅ Ability to meet **listing guidelines** and optimize for search visibility  \n✅ **Basic image editing skills** (optional but a plus)\n\n# Payment:\n\n💰 **$20 per listing** (paid via PayPal)\n\n# How to Apply:\n\nIf you're interested, please **comment or message me** with:  \n🔹 Your **experience with product listing**  \n🔹 Examples of **previous listings** (if available)  \n🔹 Your **email** for further communication\n\n🚨 **Due to Reddit chat limitations, please include your email so I can reach out directly.**\n\nI’ll be reviewing applications and messaging potential candidates soon. Thanks!",
    "url": "https://www.reddit.com/r/forhire/comments/1jiucrg/hiring_product_lister_20_per_listing/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  },
  {
    "title": "[Hiring] Finding as many editors as I can.",
    "description": "You can earn also. Just Dm me! ",
    "url": "https://www.reddit.com/r/forhire/comments/1jisvpi/hiring_finding_as_many_editors_as_i_can/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  },
  {
    "title": "[Hiring] Sales &amp; Marketing Soecialist",
    "description": "DJK Solutions Surrey is an innovative digital agency offering AI-powered marketing solutions to help businesses scale their online presence effortlessly. We specialise in social media management, content creation, and digital growth strategies that deliver real results.\n\nWe’re looking for ambitious, self-motivated individuals to join our team as Sales &amp; Marketing Specialists. In this role, you’ll be responsible for the entire 360° sales cycle—from generating leads to closing deals and managing client marketing campaigns. If you’re driven, confident, and looking for unlimited earning potential, this is the perfect opportunity for you.\n\nWhat You’ll Do:\n\nAs a Sales &amp; Marketing Specialist, you’ll take full ownership of the sales and marketing process:\n\t1.\tLead Generation – Identify and reach out to potential clients via email, LinkedIn, social media, and calls.\n\t2.\tSales &amp; Closing – Present and sell our AI-driven marketing services, tailoring solutions to client needs.\n\t3.\tClient Management &amp; Marketing – Oversee and coordinate their marketing campaigns, ensuring high performance and client satisfaction.\n\nWhat We’re Looking For:\n\t•\tStrong sales and marketing skills (experience preferred but not required).\n\t•\tA self-starter who thrives in a commission-based role.\n\t•\tExcellent communication and persuasion abilities.\n\t•\tConfidence in pitching and selling digital marketing solutions.\n\t•\tAbility to manage client relationships and oversee marketing performance.\n\t•\tStrong time management skills and ability to work remotely.\n\nWhat We Offer:\n\t•\tUncapped earning potential – earn as much as you put in!\n\t•\tFull flexibility – work remotely and set your own schedule.\n\t•\t360° role experience – handle everything from sales to marketing execution.\n\t•\tInnovative AI-powered solutions – cutting-edge services that are easy to sell.\n\t•\tSupport &amp; training – guidance to help you succeed.\n\t•\tCareer growth – top performers will have opportunities for leadership roles as we expand.\n\nWhy Join DJK Solutions Surrey?\n\nThis is more than just a sales job—you’ll gain full hands-on experience in both sales and digital marketing while earning high commissions. If you’re ready to take control of your earnings and career, we’d love to have you on board!\n\nHow to Apply:\n\nSend your CV and a short cover letter explaining why you’d be a great fit to djksolutionssurrey1@gmail.com.\n\nJoin us and be part of the future of AI-powered marketing!\n\nBase pay of £15/hr depending if leads and sales are executed well.",
    "url": "https://www.reddit.com/r/forhire/comments/1jis2e1/hiring_sales_marketing_soecialist/",
    "platform": "reddit/r/forhire",
    "source": "reddit"
  }
]
